In [1]:
import pandas as pd
import os

In [2]:
os.getcwd()

'C:\\Users\\prafulla.kamble\\Downloads\\0PRK\\ML\\DataScience_Tips_Tricks_and_Career_Advice-master'

In [23]:
os.chdir(os.getcwd()+"\\Convert_SQL_Queries_into_Python_Pandas")

FileNotFoundError: [WinError 2] The system cannot find the file specified: 'C:\\Users\\prafulla.kamble\\Downloads\\0PRK\\ML\\DataScience_Tips_Tricks_and_Career_Advice-master\\Convert_SQL_Queries_into_Python_Pandas\\Convert_SQL_Queries_into_Python_Pandas'

In [24]:
os.getcwd()

'C:\\Users\\prafulla.kamble\\Downloads\\0PRK\\ML\\DataScience_Tips_Tricks_and_Career_Advice-master\\Convert_SQL_Queries_into_Python_Pandas'

In [25]:
os.listdir()

['Convert_SQL_Queries_into_Python_Pandas.ipynb',
 'Convert_SQL_Queries_into_Python_Pandas.py',
 'Mall_Customers.csv',
 'Mall_Customers_Transactions.csv',
 'Shop_Customers.csv']

In [32]:
df = pd.read_csv("Mall_Customers.csv")
df.head()

   CustomerID   Genre  Age  Annual_Income_K_Dollars  Spending_Score_1_to_100
0           1    Male   19                       15                       39
1           2    Male   21                       15                       81
2           3  Female   20                       16                        6
3           4  Female   23                       16                       77
4           5  Female   31                       17                       40

In [33]:
len(df)

200

In [37]:
# 3 selet CustomerID from df where Annual_Income_K_Dollars == 16;
df[df.Annual_Income_K_Dollars == 16].CustomerID

2    3
3    4
Name: CustomerID, dtype: int64

In [39]:
df[[df.Annual_Income_K_Dollars == 16]][['CustomerID','Age']]

ValueError: Item wrong length 1 instead of 200.

In [45]:
# selct * from df where ann.. == 16 and Spend... == 6

df[(df.Annual_Income_K_Dollars > 16)  & (df.Spending_Score_1_to_100 == 6)]

   CustomerID   Genre  Age  Annual_Income_K_Dollars  Spending_Score_1_to_100
6           7  Female   35                       18                        6

In [48]:
# select Age, Spen... from df where ann == 16 and spen.. == 6
df[(df.Annual_Income_K_Dollars == 16) & (df.Spending_Score_1_to_100 == 6)][['Age','Genre','CustomerID']]

   Age   Genre  CustomerID
2   20  Female           3

In [50]:
# select mean(Age), max(Age), min(Age) from df
df.agg({'Age': ['mean','max','median']})

          Age
mean    38.85
max     70.00
median  36.00

In [53]:
# select DISTINCT Annnual....uniuqe()
df['Annual_Income_K_Dollars'].unique()

array([ 15,  16,  17,  18,  19,  20,  21,  23,  24,  25,  28,  29,  30,
        33,  34,  37,  38,  39,  40,  42,  43,  44,  46,  47,  48,  49,
        50,  54,  57,  58,  59,  60,  61,  62,  63,  64,  65,  67,  69,
        70,  71,  72,  73,  74,  75,  76,  77,  78,  79,  81,  85,  86,
        87,  88,  93,  97,  98,  99, 101, 103, 113, 120, 126, 137],
      dtype=int64)

In [58]:
# select * from df where genre = 'Female' order by Spen....;
df[df['Genre'] == 'Female'].sort_values('Annual_Income_K_Dollars')

     CustomerID   Genre  Age  Annual_Income_K_Dollars  Spending_Score_1_to_100
2             3  Female   20                       16                        6
3             4  Female   23                       16                       77
4             5  Female   31                       17                       40
5             6  Female   22                       17                       76
6             7  Female   35                       18                        6
..          ...     ...  ...                      ...                      ...
190         191  Female   34                      103                       23
193         194  Female   38                      113                       91
195         196  Female   35                      120                       79
194         195  Female   47                      120                       16
196         197  Female   45                      126                       28

[112 rows x 5 columns]

In [60]:
# select * from df where genre = 'Female' order by Spen.... desc;
df[df['Genre'] == 'Female'].sort_values('Annual_Income_K_Dollars', ascending=False)

     CustomerID   Genre  Age  Annual_Income_K_Dollars  Spending_Score_1_to_100
196         197  Female   45                      126                       28
195         196  Female   35                      120                       79
194         195  Female   47                      120                       16
193         194  Female   38                      113                       91
191         192  Female   32                      103                       69
..          ...     ...  ...                      ...                      ...
7             8  Female   23                       18                       94
4             5  Female   31                       17                       40
5             6  Female   22                       17                       76
3             4  Female   23                       16                       77
2             3  Female   20                       16                        6

[112 rows x 5 columns]

In [71]:
# select genre, age, count(*) from df group by genre, age;
df.groupby(['Genre','Age']).size().to_frame('Count').reset_index()
# size() to count
# to_frame to give a name to a count column name

     Genre  Age  Count
0   Female   18      1
1   Female   19      2
2   Female   20      2
3   Female   21      4
4   Female   22      2
..     ...  ...    ...
82    Male   66      1
83    Male   67      3
84    Male   68      1
85    Male   69      1
86    Male   70      2

[87 rows x 3 columns]

In [84]:
# select genre, age, count(*) from df group by age,genre DESC;
df.groupby(['Age','Genre']).size().to_frame('Count').reset_index().sort_values(['Age','Genre'],ascending=False)

    Age   Genre  Count
86   70    Male      2
85   69    Male      1
84   68    Male      1
83   68  Female      2
82   67    Male      3
..  ...     ...    ...
4    20  Female      2
3    19    Male      6
2    19  Female      2
1    18    Male      3
0    18  Female      1

[87 rows x 3 columns]

In [85]:
# select Age, COUNT(*) from df groupby Age having count(*) < 3
df.groupby('Age').filter(lambda g: len(g) < 3).groupby('Age').size()

Age
26    2
41    2
42    2
44    2
51    2
52    2
53    2
55    1
56    1
57    2
58    2
63    2
64    1
65    2
66    2
69    1
70    2
dtype: int64